--
-- Created by IntelliJ IDEA.
-- User: Administrator
-- Date: 2017/5/7
-- Time: 22:37
-- To change this template use File | Settings | File Templates.
--


local patterns = {[[
975

孟之经说道：「这里人多眼杂，你先到江南小道等候，我自会通知你。」

> 孟之经托付都府内常随送给了你一页密码。
孟之经(meng zhijing)告诉你：第一个字在：第八行，第十列。第二个字在：第一行，第十列。第三个字在：第九行，第七列。对照(duizhao)这页，你就知道你要刺杀的人在哪了。

duizhao
你背着众人，悄悄地打开了旧纸。

殺1 2 3 4 5 6 7 8 9 1011
1 疆城襄阜丝府江后明驼帮
2 曲天山平村临西岳寨凉湖
3 湖王手岳真龙山兴府苗山
4 福府曲洛曲襄城丝源中王
5 江中府昆康容嵋嵋目白北
6 北临府山花原阜大安城曲
7 安家河府安谷平临教泉庄
8 城寺清州西武路府丝白麒
9 长山寺州天目山西慕成安

> 你定睛一看，彭晓峦正是你要找的汉奸卖国贼！
东街
    大元 建康府南城路安抚副使 彭晓峦(Peng xiaoluan)

大元 建康府南城路招讨副使 顾杰(Gu jie)

上官年往东落荒而逃了。

恭喜！你完成了都统制府行刺任务！

]]}

