--
-- Created by IntelliJ IDEA.
-- User: Administrator
-- Date: 2017/6/5
-- Time: 7:23
-- To change this template use File | Settings | File Templates.
--

local patterns = {[[
15

ask han about job
你向韩员外打听有关『job』的消息。
韩员外说道：「壮士能为我韩家出头，复仇指日可待！[+1]」
大约需要至少经历2分钟后，任务奖励可以全额获取。
韩员外说道：韩家仇人闻人茜(wenren xi)据传将在晋阳的铁匠巷出现，你去将其狙杀！
其人心思缜密，你不到最后五秒不要现身，否则打草惊蛇，悔之晚矣。但也不能迟过他出现的时分，否则其人脱困而去。
> 韩家仇人闻人茜将在九十四秒后经过狙击地点。

韩家仇人闻人茜将在五秒后经过狙击地点。
e
铁匠巷
> 韩家仇人闻人茜将在四秒后经过狙击地点。
韩家仇人闻人茜将在三秒后经过狙击地点。
闻人茜出现了！正是狙杀其的大好时机！
闻人茜很错愕的看着你：你是韩员外派来的？

你向韩员外打听有关『job』的消息。
韩员外说道：「壮士能为我韩家出头，复仇指日可待！[+1]」
大约需要至少经历2分钟后，任务奖励可以全额获取。
韩员外说道：韩家仇人刑瑗珠(xing yuanzhu)据传在『大理城中』出现过，快去帮我杀了他！
此人是易容高手，须谨防其走脱。

> 看起来刑瑗珠想杀死你！
刑瑗珠将手中的长剑插回剑鞘。
刑瑗珠「唰」的一声抽出一柄长剑握在手中。
大和街
    罪该万死 刑瑗珠(Xing yuanzhu)

l xing
罪该万死 刑瑗珠(Xing yuanzhu)
这是一位桃花岛高手。
她看起来约四十多岁。
她现在娇若春花，媚如秋月，真的能沉鱼落雁。。
她的武艺看上去马马虎虎，出手似乎很重。
她看起来气血充盈，并没有受伤。

刑瑗珠稍稍接战，立刻退走。

有江湖小道消息，据说刑瑗珠正在临安府隐姓埋名。


]]}

