--
-- Created by IntelliJ IDEA.
-- User: Administrator
-- Date: 2017/4/8
-- Time: 8:10
-- To change this template use File | Settings | File Templates.
--

local patterns = {[[
listesc
福州福威镖局押镖任务列表：
任务序号  任务目的地               任务发布时间   任务状态 认领玩家
=============================================================================
16975     临安府江南钱庄                    510秒   已认领 gengfeng
16976     嘉兴钱庄                          510秒   已认领 akking
16977     归云庄太湖街                      510秒   待认领 0
16984     牙山小荒地                        353秒   待认领 0
16985     泉州当铺                          353秒   已完成 atomy
16986     嘉兴陆家庄大厅                    353秒   待认领 0
=============================================================================
使用命令【getesc 任务序号】来认领押镖任务。

getesc 34854
林震南点了点头。
几个伙计将镖推了出来。
撸啊把这批红货送到泉州当铺王福贵那里，他已经派了个伙计名叫令狐轩梅到泉州码头附近接你，把镖车送到他那里就行了。

gan che to west
西大街
你赶着镖车驶了过来。
镖车隆隆驶了过来。
>
gan che to west
镖车还没有跟上来呢,走慢点.

gan che to north
劫匪伸手一拦道：“想跑？没那么容易！”

你累了个半死，终于把镖运到了地头。

令狐轩梅对你说道：“终于到了！小兄弟辛苦了！”

围上来几个伙计将镖车拉了进去。

ask lin about finish
你向林震南打听有关『finish』的消息。
你一共被奖励了：
三百零四点经验；
一百十点潜能；
六十七点江湖声望。
林震南吩咐了旁边的镖头几句，转头对你道：「辛苦了，有几两银子略表心意，已经吩咐人存入你的钱庄账户。」
林震南拍了拍撸啊的头，说道：「好孩子，乖。」
林震南说道：「小兄弟果然是栋梁之才！」

getesc 34853
林震南点了点头。
几个伙计将镖推了出来。
撸啊把这批红货送到苏州聚宝斋孙剥皮那里，他已经派了个伙计名叫樊柏慕到沧浪亭附近接你，把镖车送到他那里就行了。

你赶着镖车驶了过来。
镖车隆隆驶了过来。
> 你累了个半死，终于把镖运到了地头。

樊柏慕对你说道：“终于到了！小兄弟辛苦了！”

围上来几个伙计将镖车拉了进去。

getesc 34882
林震南点了点头。
几个伙计将镖推了出来。
撸啊把这批红货送到泉州当铺王福贵那里，他已经派了个伙计名叫包云永到南门附近接你，把镖车送到他那里就行了。

gan che to northwest
这个方向过不去。

listesc
福州福威镖局押镖任务列表：
任务序号  任务目的地               任务发布时间   任务状态 认领玩家
=============================================================================
34882     泉州当铺                          471秒   已完成 luar
34883     镇江飞龙镖局                      471秒   已认领 crafting
34884     嘉兴陆家庄大厅                    471秒   待认领 0
34891     岳王墓墓前广场                    154秒   待认领 0
34892     泉州当铺                          154秒   待认领 0
34893     牙山小荒地                        154秒   待认领 0
=============================================================================
使用命令【getesc 任务序号】来认领押镖任务。

getesc 34893
林震南点了点头。
几个伙计将镖推了出来。
撸啊把这批红货送到牙山小荒地黄毛鬼那里，他已经派了个伙计名叫樊慕郎到破屋附近接你，把镖车送到他那里就行了。

劫匪突然从暗处跳了出来，阴笑道：“红货和人命都留下来吧！。”

getesc 34901
林震南点了点头。
几个伙计将镖推了出来。
撸啊把这批红货送到镇江飞龙镖局张经那里，他已经派了个伙计名叫余坚七到土路附近接你，把镖车送到他那里就行了。

劫匪伸手一拦道：“想跑？没那么容易！”

劫匪趁你不注意，推着镖车就跑，你赶紧追了上去。

你赶着镖车驶了过来。
镖车隆隆驶了过来。
> 你累了个半死，终于把镖运到了地头。

余坚七对你说道：“终于到了！小兄弟辛苦了！”

围上来几个伙计将镖车拉了进去。
劫匪突然从暗处跳了出来，阴笑道：“红货和人命都留下来吧！。”
你在攻击中不断积蓄攻势。(气势：4%)
劫匪正盯著你的一举一动，随时准备发动攻势。

getesc 34922
林震南点了点头。
几个伙计将镖推了出来。
撸啊把这批红货送到岳王墓墓前广场包打听那里，他已经派了个伙计名叫侯征永到墓边小道附近接你，把镖车送到他那里就行了。

getesc 34916
林震南点了点头。
几个伙计将镖推了出来。
撸啊把这批红货送到归云庄太湖街商人那里，他已经派了个伙计名叫阮明到太湖街附近接你，把镖车送到他那里就行了。

劫匪叫道：点子扎手，扯呼！

劫匪个起纵遁入暗里不见了。

> 劫匪突然从暗处跳了出来，阴笑道：“红货和人命都留下来吧！。”

忽然一阵刺骨的奇寒袭来，你中的星宿毒掌毒发作了！

gan che to northwest
你还是先把对手解决了再说吧！

斜刺里冲出来小偷,猛地对你痛下杀手！
趟子手大呼：有人劫镖阿，快护镖，快快！

gan che to east
你现在正忙着哩。

getesc 34923
你所领的任务在任务列表中并不存在。
认领任务失败，请选择其他任务。

getesc 34934
林震南点了点头。
几个伙计将镖推了出来。
撸啊把这批红货送到嘉兴陆家庄大厅陆立鼎那里，他已经派了个伙计名叫左少康到大厅附近接你，把镖车送到他那里就行了。


]]}