--
-- Created by IntelliJ IDEA.
-- User: Administrator
-- Date: 2017/4/8
-- Time: 8:10
-- To change this template use File | Settings | File Templates.
--

local patterns = {[[
listesc
福州福威镖局押镖任务列表：
任务序号  任务目的地               任务发布时间   任务状态 认领玩家
=============================================================================
16975     临安府江南钱庄                    510秒   已认领 gengfeng
16976     嘉兴钱庄                          510秒   已认领 akking
16977     归云庄太湖街                      510秒   待认领 0
16984     牙山小荒地                        353秒   待认领 0
16985     泉州当铺                          353秒   已完成 atomy
16986     嘉兴陆家庄大厅                    353秒   待认领 0
=============================================================================
使用命令【getesc 任务序号】来认领押镖任务。



]]}